Repository: 84000/data-translation-memory
Catalog: toh130-v1.tmx
Source language: bo
Languages: en

source: འགུལ། རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ། གཡོས་རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། ལྡེག་རབ་ཏུ་ལྡེག ཀུན་ཏུ་རབ་ཏུ་ལྡེག འུར་འུར། རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། འཁྲུགས་རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ།
en: it vibrated, shuddered, and reeled; quivered, trembled, and quaked; wobbled, rocked, and swayed; boomed, thundered, and roared; rattled, shook, and convulsed; and clattered, rattled, and clanged.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: Then the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta went before the Blessed One, the thus-gone, worthy, completely perfect Buddha Amitābha.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། །
en: Prostrating with their heads to the Blessed One’s feet,

source: ཞེ་ས་དང་བཅས་པར་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: they respectfully stood to one side.

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Standing together, the two holy beings said to the Blessed One,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་མཐུ་བརྟན་པ་བརྙེས་པ་ནི། །
en: “The Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni has attained very stable powers.

source: བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །
en: Blessed One, it is amazing.

source: བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: Blissful One, it is amazing.

source: བཅོམ་ལྡན་འདས་འདི་ལྟར། །
en: Blessed One, it is like this.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེའི་མཚན་བརྗོད་པ་ཙམ་གྱིས་སེམས་པ་མ་མཆིས་པའི་དོག་ས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་པའི་སྙད་དུའོ། །
en: When so much as the name of the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni was pronounced, even this inanimate earth shook in six ways.”

source: དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱིས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Thus-Gone Amitābha said to the two holy beings,

source: རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པའི་མཚན་བརྗོད་པར་མ་ཟད་ཀྱི།
en: “Sons of noble family, not only was the name of the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni pronounced in this buddha realm,

source: སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་མ་དག་ན་ཡང་བཅོམ་ལྡན་འདས་དེའི་མཚན་ཡོངས་སུ་བརྗོད་དོ། །
en: the name of that Blessed One was also pronounced in many other buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་འོད་དེས་རེག་པས་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: Those buddha realms, too, all shook in six ways when touched by that light.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་མཚན་ཐོས་ནས། །
en: In those buddha realms, limitless and countless beings heard the name of the Thus-Gone Śākyamuni,

source: དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: and thereby perfected their roots of virtue and rendered irreversible their progress to unsurpassed and completely perfect awakening.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཞི་བཅུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་མཚན་ཐོས་སོ། །
en: Then, from among the assembly of bodhisattvas, four hundred million bodhisattvas heard the name of the Blessed One, the thus-gone Śākyamuni.

source: ཐོས་ནས་ཀྱང་དེ་དག་ཐམས་ཅད་འདུས་ནས་མགྲིན་གཅིག་ཏུ་དགེ་བའི་རྩ་བ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །
en: When they heard it, they all gathered and, in a single voice, dedicated the roots of virtue toward unsurpassed and completely perfect awakening.

source: དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་ཏོ། །
en: The Blessed One also prophesied that they would render irreversible their progress to unsurpassed and completely perfect awakening.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སྔོན་མ་མཐོང་མ་ཐོས་པའི་འོད་འདི་བཏང་བ་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་ནི་
en: “The Blessed One, the thus-gone Śākyamuni, has sent forth a light that we have previously never seen nor heard of.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་འདི་ལྟར་ཡིད་དུ་མཆི་བ་དང་། འདི་ལྟར་བལྟ་ན་སྡུག་པའི་འོད་མི་གཏོང་ན་
en: Now, since the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, would not emit such a wonderful and beautiful light without causes or circumstances,

source: གང་གི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་འདི་ལྟར་ཡིད་དུ་མཆི་བ་དང་། འདི་ལྟར་བལྟ་ན་སྡུག་པའི་འོད་བཀྱེ་བ་འདིའི་རྒྱུ་ནི་གང་ལགས་རྐྱེན་ནི་ཅི་ལགས།
en: please tell us what the causes and conditions are for the Blessed One, the thus-gone Śākyamuni, to send forth such a wonderful and beautiful light.”

source: དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱིས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ཏེ། །
en: The Thus-Gone Amitābha said to the two holy beings, “Sons of noble family, what you say is true.

source: རྒྱུ་མེད་རྐྱེན་མེད་པར་བཅོམ་ལྡན་འདས་དེས་འདི་ལྟར་ཡིད་དུ་འོང་བ་དང་། འདི་ལྟར་བལྟ་ན་སྡུག་པའི་འོད་མི་བཀྱེའོ། །
en: That Blessed One would not send forth such a wonderful and beautiful light without any causes and conditions.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་དེང་བྱང་ཆུབ་སེམས་དཔའ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་བསྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་སྟོན་པར་འགྱུར་ཏེ།
en: And why? Because the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, is about to deliver a Dharma teaching on how to accomplish the precious absorption known as ‘the bodhisattvas’ application.’

source: དེའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེས་ཆོས་བསྟན་པ་དེའི་སྔ་ལྟས་སུ་འདི་ལྟར་ཡིད་དུ་འོང་བ་དང་། འདི་ལྟར་བལྟ་ན་སྡུག་པའི་འོད་འདི་བཀྱེའོ།
en: That is why the Blessed One Śākyamuni emitted this wonderful and beautiful light as an omen of that Dharma teaching.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta said to the Thus-Gone, worthy, completely perfect Buddha Amitābha,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་མཆོད་པ་དང་བསྙེན་བཀུར་བགྱི་བ་དང་ཆོས་བསྟན་པ་དེ་ཡང་མཉན་པའི་སླད་དུ། །
en: “In order to gaze upon, honor, venerate, and serve the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, and also to hear his Dharma teaching,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་མཆིའོ།
en: we, Blessed One, will travel to that Sahā world.”

source: རིགས་ཀྱི་བུ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ཁྱོད་ཉིད་ལས་བརྩམས་ཏེ། ཆོས་སྟོན་པར་འགྱུར་གྱིས་དེའི་དུས་ལ་དབབ་པར་ཤེས་པ། ཁྱེད་དེང་ཤིག་ཅེས་སྐབས་ཕྱེ་བས་
en: “Sons of noble family, you know that the time has come for the Blessed One, the thus-gone Śākyamuni, to teach the Dharma to an assembly headed by the two of you, so please do go ahead.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་ཀྱིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་ཉིན་འཁོར་ན་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཞི་བཅུ་པོ་རྣམས་ལ་སྨྲས་པ། །
en: the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta called out to the four hundred million bodhisattvas assembled in the retinue of the Blessed One, the thus-gone Amitābha,

source: རིགས་ཀྱི་བུ་དག་ཚུར་ཤོག
en: “Sons of noble family, come!

source: ཁྱེད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་མཆོད་པ་དང་བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་བསྟན་པ་དེ་ཡང་མཉན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་འདོང་ངོ་། །
en: In order to behold, honor, venerate, and serve the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, and also to hear his Dharma teaching, let us travel to the Sahā world.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གཞན་དང་གཞན་དག་ན་ཡོད་པ་སྤངས་ནས། སྨོན་ལམ་དང་ཐུགས་རྗེ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དེར་བྱུང་སྟེ།
en: Because the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, gave up all the many perfectly pure buddha realms and, through his aspirations and great compassion, manifested in that afflicted buddha realm. Because he undertook austerities,

source: སེམས་ཅན་དམན་པ་ལ་མོས་པ་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བ། ཞེ་སྡང་གི་ཤས་ཆེ་བ། གཏི་མུག་གི་ཤས་ཆེ་བ་རྣམས་ཀྱི་ནང་དུ།
en: it was amidst those sentient beings who have base desires and raging attachment, anger, and delusion,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ནི་དཀའ་བ་མཛད་པའི་ཕྱིར་རོ། །
en: that he fully awakened to unsurpassed and completely perfect buddhahood.”

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས། ཚིག་འདི་སྨྲས་མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ལྷན་ཅིག་འདུས་ནས། མགྲིན་གཅིག་ཏུ་ཚིག་སྨྲས་པ།
en: As soon as the two holy beings had spoken these words, all of the bodhisattva great beings in the world of Sukhāvatī assembled and said in a single voice,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེའི་མཚན་ཐོས་པ་དེ་དག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས་ན།
en: “Blessed One, any being who even hears the name of the Blessed One, the thus-gone Śākyamuni, reaches excellent attainments.

source: གང་དག་གིས་ཤའི་མིག་གིས་དེ་མངོན་སུམ་དུ་མཐོང་ལ་མཐོང་ནས་ཀྱང་དད་པ་རྙེད་པ་དག་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: That being so, what need is there to mention those who actually see him with their physical eyes and engender faith?

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་བསྙེན་བཀུར་བགྱི་བ་དང་། ཆོས་བསྟན་པ་དེ་ཡང་མཉན་པའི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་མཆིའོ།
en: Blessed One, we shall also travel to the Sahā world in order to behold, honor, venerate, and serve the Blessed One, the thus-gone, worthy, completely perfect Buddha Śākyamuni, and also to hear his Dharma teaching.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One said,

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་དེང་ཤིག །
en: “Sons of noble family, you know that the time has come, so please go ahead.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིས་ཡོངས་སུ་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ནས་དོང་ངོ་། །
en: So the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta set out from the world of Sukhāvatī, surrounded and preceded by 840 million bodhisattvas.

source: དེ་ནས་དེའི་ཚེ་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱས་པས།
en: At that point they manifested their miraculous powers, and by those miraculous powers

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་ཐམས་ཅད་རེ་རེ་ལ་ཡང་ཁང་པ་བརྩེགས་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་སྤྲུལ་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱས་སོ།
en: million bodhisattvas each emanated 840 million mansions.

source: ཁང་པ་བརྩེགས་པ་དེ་དག་ཀྱང་གྲུ་བཞི་ལྷམ་པ་ཀ་བ་བཞི་ཟུག་པ།
en: The miraculously manifested mansions were square, structured around four pillars,

source: ཆ་མཉམ་པར་ལེགས་པར་རྣམ་པར་ཕྱེ་བ་ལེགས་པར་ཟིན་པ་ཤ་སྟག་གོ། །
en: even and well proportioned, and of excellent design.

source: ཁང་པ་བརྩེགས་པ་རེ་རེ་ཡང་འཕང་དུ་ནི་དཔག་ཚད་བཅུ་གཉིས། རྒྱར་ནི་དཔག་ཚད་བརྒྱད་དོ། །
en: Each of the mansions was twelve leagues tall and eight leagues wide.

source: ཁང་པ་བརྩེགས་པ་དག་གསེར་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: Some mansions were made of gold;

source: དངུལ་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: some were made of silver;

source: བཻ་དཱུརྱ་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: some were made of beryl;

source: ཤེལ་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: some were made of crystal;

source: མུ་ཏིག་དམར་པོ་དང་རྡོའི་སྙིང་པོ་དང་། སྤུག་ལས་བྱས་པ་དག་ཀྱང་ཡོད་དོ། །
en: some were made of red pearl, emerald, and coral;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་སྣ་གཉིས་པ་དག་ཀྱང་ཡོད།
en: some were made of combinations of gold and silver;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་སྣ་གསུམ་པ་དག་ཀྱང་ཡོད།
en: some were made of combinations of gold, silver, and beryl;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་ཤེལ་དང་སྣ་བཞི་པ་དག་ཀྱང་ཡོད།
en: some were made of combinations of gold, silver, beryl, and crystal;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་སྣ་ལྔ་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of combinations of gold, silver, beryl, crystal, and red pearl;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་སྤུག་དང་སྣ་དྲུག་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of combinations of gold, silver, beryl, crystal, red pearl, and coral;

source: རིན་པོ་ཆེ་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་སྤུག་དང་རྡོའི་སྙིང་པོ་དང་སྣ་བདུན་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of combinations of gold, silver, beryl, crystal, red pearl, coral, and emerald;

source: ཙན་དན་དམར་པོ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of red sandalwood;

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: some were made of uragasāra sandalwood;

source: ཨ་ཀ་རུ་དང་ཙན་དན་ལས་བྱས་པ་དག་ཀྱང་ཡོད། །
en: some were made of aloeswood and sandalwood;

source: ཨ་ག་རུ་ནག་པོ་དང་ཙན་དན་ལས་བྱས་པ་དག་ཀྱང་ཡོད།
en: some were made of black aloeswood and sandalwood;

source: ཙན་དན་ཐམས་ཅད་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of all types of sandalwood;

source: མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of blue lotuses, pink lotuses, water lily, and white lotuses;

source: སྣ་མའི་མེ་ཏོག་དང་བར་ཤ་ཀ་དང་ཙམ་པ་ཀ་དང་། སྐྱ་སྣར་དང་ཨ་ཏི་མུག་ཏ་ཀ་དང་ཏ་ར་ནི་དང་གོ་ཏ་ར་ནི་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད། །
en: some mansions were made of flowers of nutmeg, jasmine, magnolia, pāṭalam, mountain ebony, aloe flower, and gotaraṇi;

source: མེ་ཏོག་ད་ནུ་སྐ་རི་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད། མེ་ཏོག་མན་དཱ་ར་དང་མན་དཱ་ར་ཆེན་པོ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of danuskari flowers; some mansions were made of māndārava and mahāmāndārava flowers;

source: མེ་ཏོག་པ་རུ་ཥ་ཀ་དང་པ་རུ་ཥ་ཀ་ཆེན་པོ་དང་མཉྫུ་ཥ་ཀ་དང་མཉྫུ་ཥ་ཀ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་མདོག་མཛེས་ཆེན་པོ་དང་། མེ་ཏོག་འཁོར་ལོ་དང་འཁོར་ལོ་ཆེན་པོ་དང་ཀུན་ཏུ་འཁོར་ལོ་དང་། ཤིན་ཏུ་མཛེས་པའི་འཁོར་ལོ་དང་མེ་ཏོག་ཟླ་བ་དང་ཟླ་བ་ཆེན་པོ་དང་། ཤིན་ཏུ་མཛེས་པའི་ཟླ་བ་དང་ཟླ་བ་མཆོག་དང་། སྠ་ལ་དང་སྠ་ལ་ཆེན་པོ་དང་། ཤིན་ཏུ་མཛེས་པའི་སྠ་ལ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of flowers of pāruṣaka, mahāpāruṣaka, mañjuṣaka, mahāmañjuṣaka, roca, mahāroca, cakra, mahācakra, sarvacakra, atyartha­śobhati­cakra, candra, mahācandra, atyartha­śobhati­candra, paramacandra, sthāla, and mahāsthāla;

source: མེ་ཏོག་ཐམས་ཅད་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ཀྱང་ཡོད།
en: some mansions were made of all types of flowers;

source: ཁ་དོག་དུ་མ་པ་ཁ་དོག་སྣ་ཚོགས་ཁ་དོག་བརྒྱ་སྟོང་དུ་མ་པ་བཀྲ་བ། བལྟ་ན་སྡུག་པ་ཡོངས་སུ་དག་པ། འོད་གསལ་བ་དག་ཀྱང་ཡོད་དོ། །
en: and some were made of flowers of various colors, multiple colors, hundreds of thousands of colors, beautiful, pure, and shining.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་ལྷའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏེ། །
en: In each mansion were emanated 84,000 goddesses.

source: དེ་ན་ལྷའི་བུ་མོ་ཁ་ཅིག་གི་ལག་ན་དུང་དང་རྔ་བོ་ཆེ་དང་རྫ་རྔ་དང་ཁར་རྔ་དང་པི་བང་རྒྱུད་གཅིག་པ་དང་། གླུ་དབྱངས་སྒྲ་སྙན་པ་དང་གླིང་བུ་དང་རྒྱུད་ཅན་པི་བང་དང་པི་བང་རྒྱུད་གསུམ་པ་རྣམས་ཐོགས་ཏེ།
en: Some of the goddesses held conches, drums, clay kettle drums, wooden kettle drums, lutes, and flutes, while others sang melodiously, and yet others held up reed pipes, one-stringed lutes, and three-stringed lutes.

source: སིལ་སྙན་དང་གླུ་དབྱངས་དང་རོལ་མོའི་སྒྲ་སྐད་རྣམ་པ་མང་པོ་དེ་ལྟ་བུ་ལེན་ཅིང་འཁོད་དོ། །
en: In this way they were playing instruments, singing songs, and making music in abundance.

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཙན་དན་དམར་པོའི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: Some goddesses were holding vessels of powdered red sandalwood;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: some goddesses were holding vessels of powdered uragasāra sandalwood;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཨ་ག་རུ་དང་ཙན་དན་གྱི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: some goddesses were holding vessels of powdered aloeswood and sandalwood;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཨ་ག་རུ་ནག་པོ་དང་ཙན་དན་གྱི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: some goddesses were holding vessels of powdered black aloeswood and sandalwood;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཙན་དན་ཐམས་ཅད་ཀྱི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: some goddesses were holding vessels of all types of powdered sandalwood;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོའི་མེ་ཏོག་གི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ། །
en: some goddesses were holding vessels of powdered blue lotuses, pink lotuses, water lilies, and white lotuses;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་མེ་ཏོག་མན་དཱ་ར་དང་མན་དཱ་ར་ཆེན་པོ་དང་པ་རུ་ཥ་ཀ་དང་པ་རུ་ཥ་ཀ་ཆེན་པོ་དང་མཉྫུ་ཥ་ཀ་དང་མཉྫུ་ཥ་ཀ་ཆེན་པོ་དང་། མེ་ཏོག་མདོག་མཛེས་དང་མདོག་མཛེས་ཆེན་པོ་དང་། མེ་ཏོག་འཁོར་ལོ་དང་འཁོར་ལོ་ཆེན་པོ་དང་། ཀུན་ཏུ་འཁོར་ལོ་དང་ཤིན་ཏུ་མཛེས་པའི་འཁོར་ལོ་དང་། མེ་ཏོག་ཟླ་བ་དང་ཟླ་བ་ཆེན་པོ་དང་། ཤིན་ཏུ་མཛེས་པའི་ཟླ་བ་དང་ཟླ་བ་མཆོག་དང་། སྠ་ལ་དང་སྠ་ལ་ཆེན་པོ་དང་ཤིན་ཏུ་མཛེས་པའི་སྠ་ལའི་མེ་ཏོག་གི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ།
en: some goddesses were holding vessels of powdered flowers of māndārava, mahāmāndārava, pāruṣaka, mahāpāruṣaka, mañjuṣaka, mahāmañjuṣaka, roca, mahāroca, cakra, mahācakra, sarvacakra, atyartha­śobhati­cakra, candra, mahācandra, atyartha­śobhati­candra, paramacandra, sthāla, and mahāsthāla;

source: ལྷའི་བུ་མོ་ཁ་ཅིག་ནི་མེ་ཏོག་ཐམས་ཅད་དང་བདུག་པ་དང་སྤོས་དང་མེ་ཏོག་ཕྲེང་དང་བྱུག་པ་དང་ཕྱེ་མའི་ཕུར་མ་ཐོགས་ཤིང་འཁོད་དོ།
en: some goddesses were proffering vessels of all types of powdered flowers, perfume, incense, flower garlands, and ointments.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་བཀོད་པ་ཆེན་པོའི་སེང་གེའི་ཁྲི་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་པའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each mansion appeared an ornately decorated lion throne upon which the form of a thus-gone one was seated, adorned with the thirty-two marks of a great being.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་མུ་ཏིག་དཀར་པོ་དང་མུ་ཏིག་དམར་པོ་དང་མུ་ཏིག་མཐོན་ཀའི་མུ་ཏིག་གི་ཕྲེང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ།
en: In each of the mansions appeared 84,000 pearl garlands, made of white, red, and blue pearls.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་ལྷའི་རས་བཅོས་བུའི་རྒྱལ་མཚན་གསེར་གྱི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་གཡོགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ།
en: In each of the mansions appeared 84,000 victory banners made of divinely manufactured fabric, each of them covered in a lattice of small golden bells.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་སྤོས་ཀྱི་ཕུར་མ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each of the mansions appeared 84,000 censers of incense.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་གདུགས་ཁ་དོག་དུ་མ་པ་ཁ་དོག་སྣ་ཚོགས་པ། ཁ་དོག་བརྒྱ་སྟོང་དུ་མ་བཀྲ་བ། བལྟ་ན་སྡུག་པ། ལེགས་པར་ལས་སུ་བྱས་པ། དབྱིབས་ཤིན་ཏུ་ལེགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each of the mansions appeared 84,000 parasols of various colors, multiple colors, hundreds of thousands of colors, beautiful, well-crafted, and of fine proportions.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་ཤིང་ཏ་ལའི་ཕྲེང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each of the mansions appeared 84,000 rows of palm trees.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each of the mansions appeared 84,000 jewel trees.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་གང་དག་རླུང་གིས་བསྐྱོད་པ་ན་འདི་ལྟ་བུའི་སྒྲ་དག་འབྱུང་བ་འདི་ལྟ་སྟེ་དཔེར་ན། ལྷའི་སིལ་སྙན་ཡན་ལག་བྱེ་བ་བརྒྱ་སྟོང་དང་ལྡན་པ་མཁས་པ་དག་གིས་ལེགས་པར་བླངས་ནས་སྒྲ་འབྱུང་བ་དེ་བཞིན་དུ་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དེ་དག་ཀྱང་རླུང་གིས་བསྐྱོད་ན་སྒྲ་སྙན་པ་ཡིད་དུ་འོང་བ་དག་འབྱུང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: In each of the mansions appeared 84,000 lattices of small bells that, when stirred by the wind, sounded tunes resembling the music performed by skilled musicians playing trillions of divine instruments. Such were the sweet and beautiful tunes that rang out from those bells when stirred by the wind.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་རྫིང་བུ་གཞི་གསེར་གྱི་བྱེ་མ་བདལ་བ། བཻ་དཱུརྱ་དང་ཤེལ་གྱིས་སྤྲས་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁ་ཁྱེར་གྱིས་བསྐོར་བ། མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོས་གང་བ། ངུར་པ་སྒྲ་འབྱིན་པ། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ། བྱ་རོག་གིས་བཏུང་དུ་རུང་བར་མུ་དང་ཁ་ད་ཆད་དུ་གང་བ་དག་སྤྲུལ་ཏོ།
en: In each of the mansions appeared ponds, the bottom of each lined with gold dust, adorned with beryl and crystal, and encircled by a ring of the seven precious gemstones. The ponds were filled with blue and pink lotuses, water lilies, and white lotus flowers, and on them were wild geese calling out. The ponds were filled to the brim with water of eight properties, making them excellent for the birds to quench their thirst.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་བསྐོར་ཏོ། །
en: Each of the mansions was surrounded by seven rows of jewel trees,

source: རིན་པོ་ཆེའི་སྐུད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཀུན་ནས་དཀྲིས་སོ། །
en: and 84,000 jewel strings bound them all together.

source: རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་རེ་རེའི་འོད་ཀྱིས་ཀྱང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་སྣང་བར་གྱུར་ཏོ། །
en: The light shining from each of the mansions extended for 84,000 leagues.

source: དེ་བཞིན་དུ་ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་ཀྱི་བཀོད་པ་དག་སོ་སོར་བྱས་སོ། །
en: Such was the layout of all the mansions.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཁང་པ་བརྩེགས་པ་བཀོད་པ་ཇི་སྙེད་ཡོད་པ། ཁང་པ་བརྩེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་ན་བཀོད་པ་ཆེན་པོ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཁང་པ་བརྩེགས་པ་རེ་རེར་མངོན་པར་སྤྲུལ་ཏོ། །སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: Inside each of those mansions, the bodhisattva great being Avalokiteśvara and the bodhisattva great being Mahā­sthāmaprāpta then again emanated the entire display of all the mansions that they had produced, along with all of their elaborate internal contents, in a precise copy.

source: ཁང་པ་བརྩེགས་པ་རེ་རེར་ཡང་དེ་ལྟར་བཀོད་པ་རྣམས་མངོན་པར་སྤྲུལ་
en: had emanated those displays inside each of the mansions,

source: བཀོད་པ་དེ་ལྟ་བུ་དེས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་ཏུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་ལས་རྐྱོང་བ་དང་། བརྐྱང་བ་ལས་སྐུམ་པ་ཙམ་གྱིས་དེ་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་ཏོ།
en: the displays together with 840 billion bodhisattvas all vanished from the world of Sukhāvatī and arrived here in this Sahā world in just a single moment, a single second, a single instant. It happened as quickly as it takes for a strong person to extend his arm and flex it again.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་ཀྱིས་དེའི་ཚེ་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་བྱས་པས། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ལག་མཐིལ་བཞིན་དུ་མཉམ་པར་གྱུར་པ།
en: At that point the two bodhisattvas miraculously transformed this Sahā world so that it became as even as the palm of a hand.

source: དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་བྱས་སོ། །
en: Such was the miracle that they manifested.
